# Path to database file
DATABASE_PATH = "./notes.json"

# Error messages
FILE_NOT_FOUND = "Файл с заметками не найден. Убедитесь в том, что хотя бы одна заметка была создана ранее."
RECORD_NOT_FOUND = "Заметка с таким ID не найдена. Проверьте правильность ввода."
INCORRECT_MENU_ITEM = "Пункт меню - это цифра от 0 до 6. Введите корректный пункт меню."
INCORRECT_USER_ID = "Идентификатор пользователя должен быть целым положительным числом. Введите корректное значение."
NO_USER_ID = "Идентификатор пользователя не введён. До выполнения других действий введите идентификатор пользователя."
INCORRECT_NOTE_ID = "Номер заметки должен быть целым положительным числом. Введите корректное значение."
NO_RECORDS_FOUND = "Записей не найдено."
WRONG_USER_ID = "Заметка создана другим пользователем. В доступе отказано."

# Main menu
SEPARATOR = "------------------------------------------"
MAIN_MENU_ITEMS = {
    "1": " Ввести идентификатор пользователя (любое целое положительное число)",
    "2": " Просмотреть все свои заметки",
    "3": " Создать новую заметку",
    "4": " Вывести на экран заметку с определённым номером",
    "5": " Редактировать заметку с определённым номером",
    "6": " Удалить заметку с определённым номером",
    "0": " Завершить работу",
}

# App info
APP_TITLE = "Приложение MyNotebook"
APP_VERSION = "(версия 0.0.1)"
APP_INTRO = "--- Сохраняй, просматривай, корректируй и удаляй заметки на любые темы ---"
